Revit 2027 API
FamilySymbol.StructuralMaterialType Property
This property returns the physical material from which the type is made.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralMaterialType StructuralMaterialType { get; }
Public ReadOnly Property StructuralMaterialType As StructuralMaterialType
	Get
public:
property StructuralMaterialType StructuralMaterialType {
	StructuralMaterialType get ();
}
member StructuralMaterialType : StructuralMaterialType with get
Property Value
StructuralMaterialType
Remarks
Values of this property can be Steel, Concrete, Wood or some other material.
See Also
Reference
FamilySymbol Class
Autodesk.Revit.DB Namespace